Show / Hide Table of Contents
Class WallRect
Representation of rectangular element2D in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Element2D
Wall
WallRect
Implements
IGeometryPart
Inherited Members
 Wall.Name
 Wall.GeomId
 Wall.MasterComponent
 Wall.MasterPoint
 Wall.InsertPoint
 Wall.Edges
 Wall.Position
 Element2D.Material
 Element2D.GeometricRegion
 Element2D.Thickness
 Element2D.EccentricityZ
 Element2D.InnerLines
 Element2D.InnerPoints
 Element2D.ElementType
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Wall))]
public class WallRect : Wall, IGeometryPart
Constructors
Improve this Doc   View Source
WallRect()
Coonstructor
Declaration
public WallRect()
Properties
Improve this Doc   View Source
Height
Height of wall
Declaration
public double Height { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Offset1
Offset horizontal top left
Declaration
public double Offset1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Offset2
Offset horizontal top left
Declaration
public double Offset2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Width
Width of wall
Declaration
public double Width { get; set; }
Property Value
 Type |  Description
 System.Double
Implements
 IGeometryPart
 Improve this Doc
 View Source